Alexchinaxian/MyF429Code/U_PSDR_VSL_CT6K/Board/BOARD_U_CNTL_VSL6K_A_STM32G0B1VET6.h
/***********************************************************************************************************************
* Copyright (c) , CVTE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
文件 : BOARD_U_CNTL_VSL6K_A_STM32G0B1VET6.h 
 用途 : 板卡硬件配置头文件
***********************************************************************************************************************/
#ifndef __BOARD_U_CNTL_CT6K_A_STM32G0B1VET6_H__
#define __BOARD_U_CNTL_CT6K_A_STM32G0B1VET6_H__

#include "HeadFile.h"

#define MPU_CLOCK                                (64)                                                                  //系统时钟频率,单位MHz

//蜂鸣器PWM驱动
#if EN_BUZZER_PWM
#define DEV_BUZZER_PWM_TIMER                    TIM1
#define DEV_BUZZER_PWM_PRESCALER                (SystemCoreClock / 1000000)
#define DEV_BUZZER_PWM_RELOAD                   (23435)                                                                //PWM frequency = 64000000/23435 = 2731Hz
#define DEV_BUZZER_PWM_COMPARE                  (16000)                                                                //PWM Duty = 16000/32000 = 50%
#define DEV_BUZZER_PWM_CHANNEL                  PR_TIM_CHANNEL_CH1
#define DEV_BUZZER_ON()                         PR_TIM_EnableAllOutputs(DEV_BUZZER_PWM_TIMER)
#define DEV_BUZZER_OFF()                        PR_TIM_DisableAllOutputs(DEV_BUZZER_PWM_TIMER)
#endif

//显示器驱动
#if EN_LCD_12864_KS0108
#define DEV_LCD_CS1_PORT                        PR_GPIOB
#define DEV_LCD_CS1_PIN                         PR_GPIO_PIN_11
#define DEV_LCD_CS2_PORT                        PR_GPIOB
#define DEV_LCD_CS2_PIN                         PR_GPIO_PIN_12
#define DEV_LCD_RS_PORT                         PR_GPIOA
#define DEV_LCD_KS0108_RS_PIN                   PR_GPIO_PIN_10
#define DEV_LCD_RW_PORT                         PR_GPIOA
#define DEV_LCD_KS0108_RW_PIN                   PR_GPIO_PIN_11
#define DEV_LCD_DB_PORT                         PR_GPIOD
#define DEV_LCD_DB0_PIN                         PR_GPIO_PIN_8
#define DEV_LCD_DB1_PIN                         PR_GPIO_PIN_9
#define DEV_LCD_DB2_PIN                         PR_GPIO_PIN_10
#define DEV_LCD_DB3_PIN                         PR_GPIO_PIN_11
#define DEV_LCD_DB4_PIN                         PR_GPIO_PIN_12
#define DEV_LCD_DB5_PIN                         PR_GPIO_PIN_13
#define DEV_LCD_DB6_PIN                         PR_GPIO_PIN_14
#define DEV_LCD_DB7_PIN                         PR_GPIO_PIN_15
#define DEV_LCD_EN_PORT                         PR_GPIOA
#define DEV_LCD_EN_PIN                          PR_GPIO_PIN_12
#define DEV_LCD_RST_PORT                        PR_GPIOA
#define DEV_LCD_RST_PIN                         PR_GPIO_PIN_15
#define DEV_LCD_POWER_POS_PORT                  PR_GPIOC
#define DEV_LCD_POWER_POS_PIN                   PR_GPIO_PIN_7
#define DEV_LCD_POWER_NEG_PORT                  PR_GPIOC
#define DEV_LCD_POWER_NEG_PIN                   PR_GPIO_PIN_9
#define DEV_LCD_KS0108_D0_Pos                   (8)
#endif

//失能仿真端口
#if EN_SWJ_JTAG

#endif

//按键
#if EN_KEY
//#define DEV_KEY_UP_PORT                         (PR_GPIOB)
//#define DEV_KEY_UP_PIN                          (PR_GPIO_PIN_15)
//#define DEV_KEY_DOWN_PORT                       (PR_GPIOC)
//#define DEV_KEY_DOWN_PIN                        (PR_GPIO_PIN_6)
#define DEV_KEY_DOWN_PORT                       (PR_GPIOB)
#define DEV_KEY_DOWN_PIN                        (PR_GPIO_PIN_15)
#define DEV_KEY_UP_PORT                         (PR_GPIOC)
#define DEV_KEY_UP_PIN                          (PR_GPIO_PIN_6)

#define DEV_KEY_ESC_PORT                        (PR_GPIOA)
#define DEV_KEY_ESC_PIN                         (PR_GPIO_PIN_8)
#define DEV_KEY_ENTER_PORT                      (PR_GPIOA)
#define DEV_KEY_ENTER_PIN                       (PR_GPIO_PIN_9)

#define DEV_KEY_NULL                            (0)
#define DEV_KEY_UP                              (KEY0)
#define DEV_KEY_DOWN                            (KEY1)
#define DEV_KEY_ESC                             (KEY2)
#define DEV_KEY_ENTER                           (KEY3)
#else
#define GET_KEY_STATUS()
#endif

//按键
#if EN_LED
#define DEV_LED_GRID_PORT                       (PR_GPIOF)
#define DEV_LED_GRID_PIN                        (PR_GPIO_PIN_13)

#define DEV_LED_GEN_PORT                        (PR_GPIOF)
#define DEV_LED_GEN_PIN                         (PR_GPIO_PIN_12)

#define DEV_LED_DRY_RLY1_PORT                   (PR_GPIOD)
#define DEV_LED_DRY_RLY1_PIN                    (PR_GPIO_PIN_0)

#define DEV_LED_DRY_RLY2_PORT                   (PR_GPIOD)
#define DEV_LED_DRY_RLY2_PIN                    (PR_GPIO_PIN_1)

#define DEV_LED_FAULT_PORT                      (PR_GPIOB)
#define DEV_LED_FAULT_PIN                       (PR_GPIO_PIN_14)


#define DEV_LED_GRID_ON()                       GPIO_Driver_WriteOutputPin(DEV_LED_GRID_PORT,DEV_LED_GRID_PIN,SET)
#define DEV_LED_GRID_OFF()                      GPIO_Driver_WriteOutputPin(DEV_LED_GRID_PORT,DEV_LED_GRID_PIN,RESET)

#define DEV_LED_GEN_ON()                        GPIO_Driver_WriteOutputPin(DEV_LED_GEN_PORT,DEV_LED_GEN_PIN,SET)
#define DEV_LED_GEN_OFF()                       GPIO_Driver_WriteOutputPin(DEV_LED_GEN_PORT,DEV_LED_GEN_PIN,RESET)

#define DEV_LED_FAULT_ON()                      GPIO_Driver_WriteOutputPin(DEV_LED_FAULT_PORT,DEV_LED_FAULT_PIN,SET)
#define DEV_LED_FAULT_OFF()                     GPIO_Driver_WriteOutputPin(DEV_LED_FAULT_PORT,DEV_LED_FAULT_PIN,RESET)

#define DEV_DRY_RLY1_ON()                       GPIO_Driver_WriteOutputPin(DEV_LED_DRY_RLY1_PORT,DEV_LED_DRY_RLY1_PIN,SET)
#define DEV_DRY_RLY1_OFF()                      GPIO_Driver_WriteOutputPin(DEV_LED_DRY_RLY1_PORT,DEV_LED_DRY_RLY1_PIN,RESET)

#define DEV_DRY_RLY2_ON()                       GPIO_Driver_WriteOutputPin(DEV_LED_DRY_RLY2_PORT,DEV_LED_DRY_RLY2_PIN,SET)
#define DEV_DRY_RLY2_OFF()                      GPIO_Driver_WriteOutputPin(DEV_LED_DRY_RLY2_PORT,DEV_LED_DRY_RLY2_PIN,RESET)
#endif

//SPI flash
#define DEV_GD25QXX_SPI                         hspi1                                                                   //调试前这里需要修改
#define DEV_GD25QXX_NSS_HARD_MODE               (0)                                                                     //片选硬件控制或软件控制

#if DEV_GD25QXX_NSS_HARD_MODE
#else
#define DEV_GD25QXX_CS_GPIO                     PR_GPIOE
#define DEV_GD25QXX_CS_PIN                      PR_GPIO_PIN_12
#endif

//RTC BL5372
#define DEV_BL5372_SCL_PORT                     PR_GPIOB
#define DEV_BL5372_SCL_PIN                      PR_GPIO_PIN_3

#define DEV_BL5372_SDA_PORT                     PR_GPIOB
#define DEV_BL5372_SDA_PIN                      PR_GPIO_PIN_4

