Alexchinaxian/MyF429Code/U_PSDR_VSL_CT6K/Board/BOARD_U_CNTL_VSL6K_A_STM32G0B1VET6.h
//通信相关
#define DEV_RX_BUFF_SIZE                        (512)
#define DEV_TX_BUFF_SIZE                        (512)

//板卡内部通信 绑定
#define DEV_ID_PCS                              DEV_COM_PORT1_ID                                                        //第1路通信口定义为 内部通信
#define DEV_COM_PORT1_SLAVE_SELECT_PORT         PR_GPIOE
#define DEV_COM_PORT1_SLAVE_SELECT_PIN          PR_GPIO_PIN_4
#define DEV_COM_PORT1_SELECT_PCS()              GPIO_Driver_WriteOutputPin(DEV_COM_PORT1_SLAVE_SELECT_PORT, DEV_COM_PORT1_SLAVE_SELECT_PIN, GPIO_PIN_RESET)
#define DEV_COM_PORT1_SELECT_BACKUP()           GPIO_Driver_WriteOutputPin(DEV_COM_PORT1_SLAVE_SELECT_PORT, DEV_COM_PORT1_SLAVE_SELECT_PIN, GPIO_PIN_SET)

//BMS通信 绑定
#define DEV_ID_BMS                              DEV_COM_PORT2_ID                                                        //第2路通信口定义为 BMS通信
#define DEV_COM_BMS_RS485_EN_PORT               PR_GPIOD
#define DEV_COM_BMS_RS485_EN_PIN                PR_GPIO_PIN_4
#define DEV_COM_BMS_RS485_TX_EN()               GPIO_Driver_WriteOutputPin(DEV_COM_BMS_RS485_EN_PORT,DEV_COM_BMS_RS485_EN_PIN,GPIO_PIN_SET)
#define DEV_COM_BMS_RS485_RX_EN()               GPIO_Driver_WriteOutputPin(DEV_COM_BMS_RS485_EN_PORT,DEV_COM_BMS_RS485_EN_PIN,GPIO_PIN_RESET)

//WIFI/GPRS通信 绑定
#define DEV_ID_WIFI_GPRS                        DEV_COM_PORT3_ID                                                        //第3路通信口定义为 WIFI/GPRS通信
#define DEV_COM_WIFI_RS485_EN_PORT              PR_GPIOE
#define DEV_COM_WIFI_RS485_EN_PIN               PR_GPIO_PIN_2
#define DEV_COM_WIFI_RS485_TX_EN()              GPIO_Driver_WriteOutputPin(DEV_COM_WIFI_RS485_EN_PORT,DEV_COM_WIFI_RS485_EN_PIN,GPIO_PIN_SET)
#define DEV_COM_WIFI_RS485_RX_EN()              GPIO_Driver_WriteOutputPin(DEV_COM_WIFI_RS485_EN_PORT,DEV_COM_WIFI_RS485_EN_PIN,GPIO_PIN_RESET)

#define DEV_ID_BLT                              DEV_COM_PORT4_ID                                                        //第4路通信口定义为 蓝牙通信

//AFCI 或 Debug通信 绑定
#define DEV_ID_DEBUG                            DEV_COM_PORT5_ID                                                        //第5路通信口定义为 debug通信
#define DEV_COM_AFCI_RS485_EN_PORT              PR_GPIOE
#define DEV_COM_AFCI_RS485_EN_PIN               PR_GPIO_PIN_7
#define DEV_COM_AFCI_RS485_TX_EN()              GPIO_Driver_WriteOutputPin(DEV_COM_AFCI_RS485_EN_PORT,DEV_COM_AFCI_RS485_EN_PIN,GPIO_PIN_SET)
#define DEV_COM_AFCI_RS485_RX_EN()              GPIO_Driver_WriteOutputPin(DEV_COM_AFCI_RS485_EN_PORT,DEV_COM_AFCI_RS485_EN_PIN,GPIO_PIN_RESET)

//电表通信 绑定
#define DEV_ID_METER                            DEV_COM_PORT6_ID                                                        //第6路通信口定义为 电表485通信
#define DEV_COM_METER_RS485_EN_PORT             PR_GPIOE
#define DEV_COM_METER_RS485_EN_PIN              PR_GPIO_PIN_3
#define DEV_COM_METER_RS485_TX_EN()             GPIO_Driver_WriteOutputPin(DEV_COM_METER_RS485_EN_PORT,DEV_COM_METER_RS485_EN_PIN,GPIO_PIN_SET)
#define DEV_COM_METER_RS485_RX_EN()             GPIO_Driver_WriteOutputPin(DEV_COM_METER_RS485_EN_PORT,DEV_COM_METER_RS485_EN_PIN,GPIO_PIN_RESET)

#if 1
#define PR_COM_ID1                              0
#define PR_COM_ID2                              1
#define PR_COM_ID3                              2
#define PR_COM_ID4                              3
#define PR_COM_ID5                              4
#define PR_COM_ID6                              5
#define DEV_ID_MAX                              6
#endif

#if EN_COM_PORT_1
#define DEV_COM_PORT1                           USART3
#define DEV_COM_PORT1_ID                        PR_COM_ID3
#define DEV_COM_PORT1_BAUDRATE                  38400
#define DEV_COM_PORT1_WORDLEN                   PR_USART_DATAWIDTH_8B
#define DEV_COM_PORT1_STOPBIT                   PR_USART_STOPBITS_1
#define DEV_COM_PORT1_PARITY                    PR_USART_PARITY_NONE
#define DEV_COM_PORT1_TX_PORT                   PR_GPIOC
#define DEV_COM_PORT1_RX_PORT                   PR_GPIOC
#define DEV_COM_PORT1_TX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT1_RX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT1_TX_PIN                    PR_GPIO_PIN_10
#define DEV_COM_PORT1_RX_PIN                    PR_GPIO_PIN_11
#define DEV_COM_PORT1_TX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT1_RX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT1_PRIORITY                  (1)
#define DEV_COM_PORT1_TX_DMA                    PR_DMA1
#define DEV_COM_PORT1_TX_DMA_CHANNEL            PR_DMA_CHANNEL_2
#define DEV_COM_PORT1_RX_DMA                    PR_DMA1
#define DEV_COM_PORT1_RX_DMA_CHANNEL            PR_DMA_CHANNEL_1
#define DEV_COM_PORT1_DMA_TXBUFF_SIZE           (512)
#define DEV_COM_PORT1_DMA_RXBUFF_SIZE           (512)
#define PR_DMA_ClearFlag_COM_PORT1              LL_DMA_ClearFlag_GI1

#if(DEV_COM_PORT1_ID == PR_COM_ID1)
#define DEV_COM_PORT1_IRQ_HANDLER               USART1_IRQHandler
#define DEV_COM_PORT1_IRQ                       USART1_IRQn
#define DEV_COM_PORT1_TX_DMAMUX                 PR_DMAMUX_REQ_USART1_TX
#define DEV_COM_PORT1_RX_DMAMUX                 PR_DMAMUX_REQ_USART1_RX
#define DEV_COM_PORT1_CLOCK                     PR_USART1_CLOCK
#define DEV_COM_PORT1_CLKSOURCE                 PR_USART1_CLKSOURCE
#elif(DEV_COM_PORT1_ID == PR_COM_ID2)
#define DEV_COM_PORT1_IRQ_HANDLER               USART2_LPUART2_IRQHandler
#define DEV_COM_PORT1_IRQ                       USART2_LPUART2_IRQn
#define DEV_COM_PORT1_TX_DMAMUX                 PR_DMAMUX_REQ_USART2_TX
#define DEV_COM_PORT1_RX_DMAMUX                 PR_DMAMUX_REQ_USART2_RX
#define DEV_COM_PORT1_CLOCK                     PR_USART2_CLOCK
#define DEV_COM_PORT1_CLKSOURCE                 PR_USART2_CLKSOURCE
#elif(DEV_COM_PORT1_ID == PR_COM_ID3)
#define DEV_COM_PORT1_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT1_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT1_TX_DMAMUX                 PR_DMAMUX_REQ_USART3_TX
#define DEV_COM_PORT1_RX_DMAMUX                 PR_DMAMUX_REQ_USART3_RX
#define DEV_COM_PORT1_CLOCK                     PR_USART3_CLOCK
#define DEV_COM_PORT1_CLKSOURCE                 PR_USART3_CLKSOURCE
#elif(DEV_COM_PORT1_ID == PR_COM_ID4)
#define DEV_COM_PORT1_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT1_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT1_TX_DMAMUX                 PR_DMAMUX_REQ_USART4_TX
#define DEV_COM_PORT1_RX_DMAMUX                 PR_DMAMUX_REQ_USART4_RX
#define DEV_COM_PORT1_CLOCK                     PR_USART4_CLOCK
#define DEV_COM_PORT1_CLKSOURCE                 PR_USART4_CLKSOURCE
#elif(DEV_COM_PORT1_ID == PR_COM_ID5)
#define DEV_COM_PORT1_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT1_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT1_TX_DMAMUX                 PR_DMAMUX_REQ_USART5_TX
#define DEV_COM_PORT1_RX_DMAMUX                 PR_DMAMUX_REQ_USART5_RX
#define DEV_COM_PORT1_CLOCK                     PR_USART5_CLOCK
#define DEV_COM_PORT1_CLKSOURCE                 PR_USART5_CLKSOURCE
#elif(DEV_COM_PORT1_ID == PR_COM_ID6)
#define DEV_COM_PORT1_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT1_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT1_TX_DMAMUX                 PR_DMAMUX_REQ_USART6_TX
#define DEV_COM_PORT1_RX_DMAMUX                 PR_DMAMUX_REQ_USART6_RX
#define DEV_COM_PORT1_CLOCK                     PR_USART6_CLOCK
#define DEV_COM_PORT1_CLKSOURCE                 PR_USART6_CLKSOURCE
#endif
#endif

#if EN_COM_PORT_2
#define DEV_COM_PORT2                           USART2
#define DEV_COM_PORT2_ID                        PR_COM_ID2
#define DEV_COM_PORT2_BAUDRATE                  9600
#define DEV_COM_PORT2_WORDLEN                   PR_USART_DATAWIDTH_8B
#define DEV_COM_PORT2_STOPBIT                   PR_USART_STOPBITS_1
#define DEV_COM_PORT2_PARITY                    PR_USART_PARITY_NONE
#define DEV_COM_PORT2_TX_PORT                   PR_GPIOD
#define DEV_COM_PORT2_RX_PORT                   PR_GPIOD
#define DEV_COM_PORT2_TX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT2_RX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT2_TX_PIN                    PR_GPIO_PIN_5
#define DEV_COM_PORT2_RX_PIN                    PR_GPIO_PIN_6
#define DEV_COM_PORT2_TX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT2_RX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT2_PRIORITY                  (2)
#define DEV_COM_PORT2_TX_DMA                    PR_DMA1
#define DEV_COM_PORT2_TX_DMA_CHANNEL            PR_DMA_CHANNEL_4
#define DEV_COM_PORT2_RX_DMA                    PR_DMA1
#define DEV_COM_PORT2_RX_DMA_CHANNEL            PR_DMA_CHANNEL_3
#define DEV_COM_PORT2_DMA_TXBUFF_SIZE           (512)
#define DEV_COM_PORT2_DMA_RXBUFF_SIZE           (512)
#define PR_DMA_ClearFlag_COM_PORT2              LL_DMA_ClearFlag_GI3

#if(DEV_COM_PORT2_ID == PR_COM_ID1)
#define DEV_COM_PORT2_IRQ_HANDLER               USART1_IRQHandler
#define DEV_COM_PORT2_IRQ                       USART1_IRQn
#define DEV_COM_PORT2_TX_DMAMUX                 PR_DMAMUX_REQ_USART1_TX
#define DEV_COM_PORT2_CLOCK                     PR_USART1_CLOCK
#define DEV_COM_PORT2_CLKSOURCE                 PR_USART1_CLKSOURCE
#elif(DEV_COM_PORT2_ID == PR_COM_ID2)
#define DEV_COM_PORT2_IRQ_HANDLER               USART2_LPUART2_IRQHandler
#define DEV_COM_PORT2_IRQ                       USART2_LPUART2_IRQn
#define DEV_COM_PORT2_TX_DMAMUX                 PR_DMAMUX_REQ_USART2_TX
#define DEV_COM_PORT2_RX_DMAMUX                 PR_DMAMUX_REQ_USART2_RX
#define DEV_COM_PORT2_CLOCK                     PR_USART2_CLOCK
#define DEV_COM_PORT2_CLKSOURCE                 PR_USART2_CLKSOURCE
#elif(DEV_COM_PORT2_ID == PR_COM_ID3)
#define DEV_COM_PORT2_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT2_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT2_TX_DMAMUX                 PR_DMAMUX_REQ_USART3_TX
#define DEV_COM_PORT2_RX_DMAMUX                 PR_DMAMUX_REQ_USART3_RX
#define DEV_COM_PORT2_CLOCK                     PR_USART3_CLOCK
#define DEV_COM_PORT2_CLKSOURCE                 PR_USART3_CLKSOURCE
#elif(DEV_COM_PORT2_ID == PR_COM_ID4)
#define DEV_COM_PORT2_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT2_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT2_TX_DMAMUX                 PR_DMAMUX_REQ_USART4_TX
#define DEV_COM_PORT2_RX_DMAMUX                 PR_DMAMUX_REQ_USART4_RX
#define DEV_COM_PORT2_CLOCK                     PR_USART4_CLOCK
#define DEV_COM_PORT2_CLKSOURCE                 PR_USART4_CLKSOURCE
#elif(DEV_COM_PORT2_ID == PR_COM_ID5)
#define DEV_COM_PORT2_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT2_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT2_TX_DMAMUX                 PR_DMAMUX_REQ_USART5_TX
#define DEV_COM_PORT2_RX_DMAMUX                 PR_DMAMUX_REQ_USART5_RX
#define DEV_COM_PORT2_CLOCK                     PR_USART5_CLOCK
#define DEV_COM_PORT2_CLKSOURCE                 PR_USART5_CLKSOURCE
#elif(DEV_COM_PORT2_ID == PR_COM_ID6)
#define DEV_COM_PORT2_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT2_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT2_TX_DMAMUX                 PR_DMAMUX_REQ_USART6_TX
#define DEV_COM_PORT2_RX_DMAMUX                 PR_DMAMUX_REQ_USART6_RX
#define DEV_COM_PORT2_CLOCK                     PR_USART6_CLOCK
#define DEV_COM_PORT2_CLKSOURCE                 PR_USART6_CLKSOURCE
#endif
#endif

#if EN_COM_PORT_3
#define DEV_COM_PORT3                           USART6
#define DEV_COM_PORT3_ID                        PR_COM_ID6
#define DEV_COM_PORT3_BAUDRATE                  9600
#define DEV_COM_PORT3_WORDLEN                   PR_USART_DATAWIDTH_8B
#define DEV_COM_PORT3_STOPBIT                   PR_USART_STOPBITS_1
#define DEV_COM_PORT3_PARITY                    PR_USART_PARITY_NONE
#define DEV_COM_PORT3_TX_PORT                   PR_GPIOB
#define DEV_COM_PORT3_RX_PORT                   PR_GPIOB
#define DEV_COM_PORT3_TX_AF                     PR_GPIO_AF_8
#define DEV_COM_PORT3_RX_AF                     PR_GPIO_AF_8
#define DEV_COM_PORT3_TX_PIN                    PR_GPIO_PIN_8
#define DEV_COM_PORT3_RX_PIN                    PR_GPIO_PIN_9
#define DEV_COM_PORT3_TX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT3_RX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT3_PRIORITY                  (2)
#define DEV_COM_PORT3_TX_DMA                    PR_DMA1
#define DEV_COM_PORT3_TX_DMA_CHANNEL            PR_DMA_CHANNEL_6
#define DEV_COM_PORT3_RX_DMA                    PR_DMA1
#define DEV_COM_PORT3_RX_DMA_CHANNEL            PR_DMA_CHANNEL_5
#define DEV_COM_PORT3_DMA_TXBUFF_SIZE           (512)
#define DEV_COM_PORT3_DMA_RXBUFF_SIZE           (512)
#define PR_DMA_ClearFlag_COM_PORT3              LL_DMA_ClearFlag_GI5

#if(DEV_COM_PORT3_ID == PR_COM_ID1)
#define DEV_COM_PORT3_IRQ_HANDLER               USART1_IRQHandler
#define DEV_COM_PORT3_IRQ                       USART1_IRQn
#define DEV_COM_PORT3_TX_DMAMUX                 PR_DMAMUX_REQ_USART1_TX
#define DEV_COM_PORT3_RX_DMAMUX                 PR_DMAMUX_REQ_USART1_RX
#define DEV_COM_PORT3_CLOCK                     PR_USART1_CLOCK
#define DEV_COM_PORT3_CLKSOURCE                 PR_USART1_CLKSOURCE
#elif(DEV_COM_PORT3_ID == PR_COM_ID2)
#define DEV_COM_PORT3_IRQ_HANDLER               USART2_LPUART2_IRQHandler
#define DEV_COM_PORT3_IRQ                       USART2_LPUART2_IRQn
#define DEV_COM_PORT3_TX_DMAMUX                 PR_DMAMUX_REQ_USART2_TX
#define DEV_COM_PORT3_RX_DMAMUX                 PR_DMAMUX_REQ_USART2_RX
#define DEV_COM_PORT3_CLOCK                     PR_USART2_CLOCK
#define DEV_COM_PORT3_CLKSOURCE                 PR_USART2_CLKSOURCE
#elif(DEV_COM_PORT3_ID == PR_COM_ID3)
#define DEV_COM_PORT3_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT3_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT3_TX_DMAMUX                 PR_DMAMUX_REQ_USART3_TX
#define DEV_COM_PORT3_RX_DMAMUX                 PR_DMAMUX_REQ_USART3_RX
#define DEV_COM_PORT3_CLOCK                     PR_USART3_CLOCK
#define DEV_COM_PORT3_CLKSOURCE                 PR_USART3_CLKSOURCE
#elif(DEV_COM_PORT3_ID == PR_COM_ID4)
#define DEV_COM_PORT3_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT3_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT3_TX_DMAMUX                 PR_DMAMUX_REQ_USART4_TX
#define DEV_COM_PORT3_RX_DMAMUX                 PR_DMAMUX_REQ_USART4_RX
#define DEV_COM_PORT3_CLOCK                     PR_USART4_CLOCK
#define DEV_COM_PORT3_CLKSOURCE                 PR_USART4_CLKSOURCE
#elif(DEV_COM_PORT3_ID == PR_COM_ID5)
#define DEV_COM_PORT3_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT3_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT3_TX_DMAMUX                 PR_DMAMUX_REQ_USART5_TX
#define DEV_COM_PORT3_RX_DMAMUX                 PR_DMAMUX_REQ_USART5_RX
#define DEV_COM_PORT3_CLOCK                     PR_USART5_CLOCK
#define DEV_COM_PORT3_CLKSOURCE                 PR_USART5_CLKSOURCE
#elif(DEV_COM_PORT3_ID == PR_COM_ID6)
#define DEV_COM_PORT3_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT3_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT3_TX_DMAMUX                 PR_DMAMUX_REQ_USART6_TX
#define DEV_COM_PORT3_RX_DMAMUX                 PR_DMAMUX_REQ_USART6_RX
#define DEV_COM_PORT3_CLOCK                     PR_USART6_CLOCK
#define DEV_COM_PORT3_CLKSOURCE                 PR_USART6_CLKSOURCE
#endif
#endif

