Alexchinaxian/MyF429Code/U_PSDR_VSL_CT6K/Board/BOARD_U_CNTL_VSL6K_A_STM32G0B1VET6.h
#if EN_COM_PORT_4
#define DEV_COM_PORT4                           USART4
#define DEV_COM_PORT4_ID                        PR_COM_ID4
#define DEV_COM_PORT4_BAUDRATE                  9600
#define DEV_COM_PORT4_WORDLEN                   PR_USART_DATAWIDTH_8B
#define DEV_COM_PORT4_STOPBIT                   PR_USART_STOPBITS_1
#define DEV_COM_PORT4_PARITY                    PR_USART_PARITY_NONE
#define DEV_COM_PORT4_TX_PORT                   PR_GPIOE
#define DEV_COM_PORT4_RX_PORT                   PR_GPIOE
#define DEV_COM_PORT4_TX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT4_RX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT4_TX_PIN                    PR_GPIO_PIN_8
#define DEV_COM_PORT4_RX_PIN                    PR_GPIO_PIN_9
#define DEV_COM_PORT4_TX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT4_RX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT4_PRIORITY                  (2)
#define DEV_COM_PORT4_TX_DMA                    PR_DMA2
#define DEV_COM_PORT4_TX_DMA_CHANNEL            PR_DMA_CHANNEL_2
#define DEV_COM_PORT4_RX_DMA                    PR_DMA1
#define DEV_COM_PORT4_RX_DMA_CHANNEL            PR_DMA_CHANNEL_7
#define DEV_COM_PORT4_DMA_TXBUFF_SIZE           (512)
#define DEV_COM_PORT4_DMA_RXBUFF_SIZE           (512)
#define PR_DMA_ClearFlag_COM_PORT4              LL_DMA_ClearFlag_GI7

#if(DEV_COM_PORT4_ID == PR_COM_ID1)
#define DEV_COM_PORT4_IRQ_HANDLER               USART1_IRQHandler
#define DEV_COM_PORT4_IRQ                       USART1_IRQn
#define DEV_COM_PORT4_TX_DMAMUX                 PR_DMAMUX_REQ_USART1_TX
#define DEV_COM_PORT4_RX_DMAMUX                 PR_DMAMUX_REQ_USART1_RX
#define DEV_COM_PORT4_CLOCK                     PR_USART1_CLOCK
#define DEV_COM_PORT4_CLKSOURCE                 PR_USART1_CLKSOURCE
#elif(DEV_COM_PORT4_ID == PR_COM_ID2)
#define DEV_COM_PORT4_IRQ_HANDLER               USART2_LPUART2_IRQHandler
#define DEV_COM_PORT4_IRQ                       USART2_LPUART2_IRQn
#define DEV_COM_PORT4_TX_DMAMUX                 PR_DMAMUX_REQ_USART2_TX
#define DEV_COM_PORT4_RX_DMAMUX                 PR_DMAMUX_REQ_USART2_RX
#define DEV_COM_PORT4_CLOCK                     PR_USART2_CLOCK
#define DEV_COM_PORT4_CLKSOURCE                 PR_USART2_CLKSOURCE
#elif(DEV_COM_PORT4_ID == PR_COM_ID3)
#define DEV_COM_PORT4_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT4_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT4_TX_DMAMUX                 PR_DMAMUX_REQ_USART3_TX
#define DEV_COM_PORT4_RX_DMAMUX                 PR_DMAMUX_REQ_USART3_RX
#define DEV_COM_PORT4_CLOCK                     PR_USART3_CLOCK
#define DEV_COM_PORT4_CLKSOURCE                 PR_USART3_CLKSOURCE
#elif(DEV_COM_PORT4_ID == PR_COM_ID4)
#define DEV_COM_PORT4_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT4_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT4_TX_DMAMUX                 PR_DMAMUX_REQ_USART4_TX
#define DEV_COM_PORT4_RX_DMAMUX                 PR_DMAMUX_REQ_USART4_RX
#define DEV_COM_PORT4_CLOCK                     PR_USART4_CLOCK
#define DEV_COM_PORT4_CLKSOURCE                 PR_USART4_CLKSOURCE
#elif(DEV_COM_PORT4_ID == PR_COM_ID5)
#define DEV_COM_PORT4_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT4_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT4_TX_DMAMUX                 PR_DMAMUX_REQ_USART5_TX
#define DEV_COM_PORT4_RX_DMAMUX                 PR_DMAMUX_REQ_USART5_RX
#define DEV_COM_PORT4_CLOCK                     PR_USART5_CLOCK
#define DEV_COM_PORT4_CLKSOURCE                 PR_USART5_CLKSOURCE

#elif(DEV_COM_PORT4_ID == PR_COM_ID6)
#define DEV_COM_PORT4_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT4_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT4_TX_DMAMUX                 PR_DMAMUX_REQ_USART6_TX
#define DEV_COM_PORT4_RX_DMAMUX                 PR_DMAMUX_REQ_USART6_RX
#define DEV_COM_PORT4_CLOCK                     PR_USART6_CLOCK
#define DEV_COM_PORT4_CLKSOURCE                 PR_USART6_CLKSOURCE
#endif
#endif

#if EN_COM_PORT_5
#define DEV_COM_PORT5                           USART5
#define DEV_COM_PORT5_ID                        PR_COM_ID5
#define DEV_COM_PORT5_BAUDRATE                  9600
#define DEV_COM_PORT5_WORDLEN                   PR_USART_DATAWIDTH_8B
#define DEV_COM_PORT5_STOPBIT                   PR_USART_STOPBITS_1
#define DEV_COM_PORT5_PARITY                    PR_USART_PARITY_NONE
#define DEV_COM_PORT5_TX_PORT                   PR_GPIOE
#define DEV_COM_PORT5_RX_PORT                   PR_GPIOE
#define DEV_COM_PORT5_TX_AF                     PR_GPIO_AF_3
#define DEV_COM_PORT5_RX_AF                     PR_GPIO_AF_3
#define DEV_COM_PORT5_TX_PIN                    PR_GPIO_PIN_10
#define DEV_COM_PORT5_RX_PIN                    PR_GPIO_PIN_11
#define DEV_COM_PORT5_TX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT5_RX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT5_PRIORITY                  (3)
#define DEV_COM_PORT5_TX_DMA                    PR_DMA2
#define DEV_COM_PORT5_TX_DMA_CHANNEL            PR_DMA_CHANNEL_3
#define DEV_COM_PORT5_RX_DMA                    PR_DMA2
#define DEV_COM_PORT5_RX_DMA_CHANNEL            PR_DMA_CHANNEL_1
#define DEV_COM_PORT5_DMA_TXBUFF_SIZE           (512)
#define DEV_COM_PORT5_DMA_RXBUFF_SIZE           (512)
#define PR_DMA_ClearFlag_COM_PORT5              LL_DMA_ClearFlag_GI1

#if(DEV_COM_PORT5_ID == PR_COM_ID1)
#define DEV_COM_PORT5_IRQ_HANDLER               USART1_IRQHandler
#define DEV_COM_PORT5_IRQ                       USART1_IRQn
#define DEV_COM_PORT5_TX_DMAMUX                 PR_DMAMUX_REQ_USART1_TX
#define DEV_COM_PORT5_RX_DMAMUX                 PR_DMAMUX_REQ_USART1_RX
#define DEV_COM_PORT5_CLOCK                     PR_USART1_CLOCK
#define DEV_COM_PORT5_CLKSOURCE                 PR_USART1_CLKSOURCE
#elif(DEV_COM_PORT5_ID == PR_COM_ID2)
#define DEV_COM_PORT5_IRQ_HANDLER               USART2_LPUART2_IRQHandler
#define DEV_COM_PORT5_IRQ                       USART2_LPUART2_IRQn
#define DEV_COM_PORT5_TX_DMAMUX                 PR_DMAMUX_REQ_USART2_TX
#define DEV_COM_PORT5_RX_DMAMUX                 PR_DMAMUX_REQ_USART2_RX
#define DEV_COM_PORT5_CLOCK                     PR_USART2_CLOCK
#define DEV_COM_PORT5_CLKSOURCE                 PR_USART2_CLKSOURCE
#elif(DEV_COM_PORT5_ID == PR_COM_ID3)
#define DEV_COM_PORT5_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT5_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT5_TX_DMAMUX                 PR_DMAMUX_REQ_USART3_TX
#define DEV_COM_PORT5_RX_DMAMUX                 PR_DMAMUX_REQ_USART3_RX
#define DEV_COM_PORT5_CLOCK                     PR_USART3_CLOCK
#define DEV_COM_PORT5_CLKSOURCE                 PR_USART3_CLKSOURCE
#elif(DEV_COM_PORT5_ID == PR_COM_ID4)
#define DEV_COM_PORT5_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT5_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT5_TX_DMAMUX                 PR_DMAMUX_REQ_USART4_TX
#define DEV_COM_PORT5_RX_DMAMUX                 PR_DMAMUX_REQ_USART4_RX
#define DEV_COM_PORT5_CLOCK                     PR_USART4_CLOCK
#define DEV_COM_PORT5_CLKSOURCE                 PR_USART4_CLKSOURCE
#elif(DEV_COM_PORT5_ID == PR_COM_ID5)
#define DEV_COM_PORT5_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT5_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT5_TX_DMAMUX                 PR_DMAMUX_REQ_USART5_TX
#define DEV_COM_PORT5_RX_DMAMUX                 PR_DMAMUX_REQ_USART5_RX
#define DEV_COM_PORT5_CLOCK                     PR_USART5_CLOCK
#define DEV_COM_PORT5_CLKSOURCE                 PR_USART5_CLKSOURCE
#elif(DEV_COM_PORT5_ID == PR_COM_ID6)
#define DEV_COM_PORT5_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT5_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT5_TX_DMAMUX                 PR_DMAMUX_REQ_USART6_TX
#define DEV_COM_PORT5_RX_DMAMUX                 PR_DMAMUX_REQ_USART6_RX
#define DEV_COM_PORT5_CLOCK                     PR_USART6_CLOCK
#define DEV_COM_PORT5_CLKSOURCE                 PR_USART6_CLKSOURCE
#endif
#endif

