Alexchinaxian/MyF429Code/U_PSDR_VSL_CT6K/Board/BOARD_U_CNTL_VSL6K_A_STM32G0B1VET6.h
#if EN_COM_PORT_6
#define DEV_COM_PORT6                           USART1
#define DEV_COM_PORT6_ID                        PR_COM_ID1
#define DEV_COM_PORT6_BAUDRATE                  9600
#define DEV_COM_PORT6_WORDLEN                   PR_USART_DATAWIDTH_8B
#define DEV_COM_PORT6_STOPBIT                   PR_USART_STOPBITS_1
#define DEV_COM_PORT6_PARITY                    PR_USART_PARITY_NONE
#define DEV_COM_PORT6_TX_PORT                   PR_GPIOB
#define DEV_COM_PORT6_RX_PORT                   PR_GPIOB
#define DEV_COM_PORT6_TX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT6_RX_AF                     PR_GPIO_AF_0
#define DEV_COM_PORT6_TX_PIN                    PR_GPIO_PIN_6
#define DEV_COM_PORT6_RX_PIN                    PR_GPIO_PIN_7
#define DEV_COM_PORT6_TX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT6_RX_PULL                   PR_GPIO_PULL_NO
#define DEV_COM_PORT6_PRIORITY                  (3)
#define DEV_COM_PORT6_TX_DMA                    PR_DMA2
#define DEV_COM_PORT6_TX_DMA_CHANNEL            PR_DMA_CHANNEL_5
#define DEV_COM_PORT6_RX_DMA                    PR_DMA2
#define DEV_COM_PORT6_RX_DMA_CHANNEL            PR_DMA_CHANNEL_4
#define DEV_COM_PORT6_DMA_TXBUFF_SIZE           (512)
#define DEV_COM_PORT6_DMA_RXBUFF_SIZE           (512)
#define PR_DMA_ClearFlag_COM_PORT6              LL_DMA_ClearFlag_GI4

#if(DEV_COM_PORT6_ID == PR_COM_ID1)
#define DEV_COM_PORT6_IRQ_HANDLER               USART1_IRQHandler
#define DEV_COM_PORT6_IRQ                       USART1_IRQn
#define DEV_COM_PORT6_TX_DMAMUX                 PR_DMAMUX_REQ_USART1_TX
#define DEV_COM_PORT6_RX_DMAMUX                 PR_DMAMUX_REQ_USART1_RX
#define DEV_COM_PORT6_CLOCK                     PR_USART1_CLOCK
#define DEV_COM_PORT6_CLKSOURCE                 PR_USART1_CLKSOURCE
#elif(DEV_COM_PORT6_ID == PR_COM_ID2)
#define DEV_COM_PORT6_IRQ_HANDLER               USART2_LPUART2_IRQHandler
#define DEV_COM_PORT6_IRQ                       USART2_LPUART2_IRQn
#define DEV_COM_PORT6_TX_DMAMUX                 PR_DMAMUX_REQ_USART2_TX
#define DEV_COM_PORT6_RX_DMAMUX                 PR_DMAMUX_REQ_USART2_RX
#define DEV_COM_PORT6_CLOCK                     PR_USART2_CLOCK
#define DEV_COM_PORT6_CLKSOURCE                 PR_USART2_CLKSOURCE
#elif(DEV_COM_PORT6_ID == PR_COM_ID3)
#define DEV_COM_PORT6_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT6_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT6_TX_DMAMUX                 PR_DMAMUX_REQ_USART3_TX
#define DEV_COM_PORT6_RX_DMAMUX                 PR_DMAMUX_REQ_USART3_RX
#define DEV_COM_PORT6_CLOCK                     PR_USART3_CLOCK
#define DEV_COM_PORT6_CLKSOURCE                 PR_USART3_CLKSOURCE
#elif(DEV_COM_PORT6_ID == PR_COM_ID4)
#define DEV_COM_PORT6_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT6_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT6_TX_DMAMUX                 PR_DMAMUX_REQ_USART4_TX
#define DEV_COM_PORT6_RX_DMAMUX                 PR_DMAMUX_REQ_USART4_RX
#define DEV_COM_PORT6_CLOCK                     PR_USART4_CLOCK
#define DEV_COM_PORT6_CLKSOURCE                 PR_USART4_CLKSOURCE
#elif(DEV_COM_PORT6_ID == PR_COM_ID5)
#define DEV_COM_PORT6_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT6_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT6_TX_DMAMUX                 PR_DMAMUX_REQ_USART5_TX
#define DEV_COM_PORT6_RX_DMAMUX                 PR_DMAMUX_REQ_USART5_RX
#define DEV_COM_PORT6_CLOCK                     PR_USART5_CLOCK
#define DEV_COM_PORT6_CLKSOURCE                 PR_USART5_CLKSOURCE
#elif(DEV_COM_PORT6_ID == PR_COM_ID6)
#define DEV_COM_PORT6_IRQ_HANDLER               USART3_4_5_6_LPUART1_IRQHandler
#define DEV_COM_PORT6_IRQ                       USART3_4_5_6_LPUART1_IRQn
#define DEV_COM_PORT6_TX_DMAMUX                 PR_DMAMUX_REQ_USART6_TX
#define DEV_COM_PORT6_RX_DMAMUX                 PR_DMAMUX_REQ_USART6_RX
#define DEV_COM_PORT6_CLOCK                     PR_USART6_CLOCK
#define DEV_COM_PORT6_CLKSOURCE                 PR_USART6_CLKSOURCE
#endif
#endif

//基准时基定时器200us
#if EN_BASE_TIMER
#define DEV_BASE_TIMER                          TIM15
#define DEV_BASE_TIMER_PRESCALER                (SystemCoreClock / 1000000)
#define DEV_BASE_TIMER_PERIOD                   (200)
#define DEV_BASE_TIMER_IRQn                     TIM15_IRQn
#define DEV_BASE_TIMER_PRIORITY                 2
#define BASE_TIME_IRQ_HANDLER                   TIM15_IRQHandler

#endif

//蜂鸣器PWM
#if EN_BUZZER_PWM
#define BUZZER_GPIO_PORT                        PR_GPIOB
#define BUZZER_GPIO_PIN                         PR_GPIO_PIN_9
#define BUZZER_GPIO_MODE                        PR_GPIO_MODE_ALTERNATE
#define BUZZER_GPIO_OUTPUTTYPE                  PR_GPIO_OUTPUT_PUSHPULL
#define BUZZER_GPIO_PULL                        PR_GPIO_PULL_NO
#define BUZZER_GPIO_AF                          PR_GPIO_AF_1

#define BUZZER_PWM_TIMER                        PR_TIM17
#define BUZZER_PWM_PRESCALER                    (SystemCoreClock / 1000000)
#define BUZZER_PWM_RELOAD                       2214
#define BUZZER_PWM_COMPARE                      0
#define BUZZER_PWM_CHANNEL                      PR_TIM_CHANNEL_CH1
#endif

//蜂鸣器美音
#if EN_MUSIC_BUZZER

#endif


#endif /***Module End***/


/***********************************************************************************************************************
* * Copyright (c) , CVTE All rights reserved.  * * * END OF FILE
***********************************************************************************************************************/

